{"weightsManifest": [{"paths": ["group1-shard1of77.bin", "group1-shard2of77.bin", "group1-shard3of77.bin", "group1-shard4of77.bin", "group1-shard5of77.bin", "group1-shard6of77.bin", "group1-shard7of77.bin", "group1-shard8of77.bin", "group1-shard9of77.bin", "group1-shard10of77.bin", "group1-shard11of77.bin", "group1-shard12of77.bin", "group1-shard13of77.bin", "group1-shard14of77.bin", "group1-shard15of77.bin", "group1-shard16of77.bin", "group1-shard17of77.bin", "group1-shard18of77.bin", "group1-shard19of77.bin", "group1-shard20of77.bin", "group1-shard21of77.bin", "group1-shard22of77.bin", "group1-shard23of77.bin", "group1-shard24of77.bin", "group1-shard25of77.bin", "group1-shard26of77.bin", "group1-shard27of77.bin", "group1-shard28of77.bin", "group1-shard29of77.bin", "group1-shard30of77.bin", "group1-shard31of77.bin", "group1-shard32of77.bin", "group1-shard33of77.bin", "group1-shard34of77.bin", "group1-shard35of77.bin", "group1-shard36of77.bin", "group1-shard37of77.bin", "group1-shard38of77.bin", "group1-shard39of77.bin", "group1-shard40of77.bin", "group1-shard41of77.bin", "group1-shard42of77.bin", "group1-shard43of77.bin", "group1-shard44of77.bin", "group1-shard45of77.bin", "group1-shard46of77.bin", "group1-shard47of77.bin", "group1-shard48of77.bin", "group1-shard49of77.bin", "group1-shard50of77.bin", "group1-shard51of77.bin", "group1-shard52of77.bin", "group1-shard53of77.bin", "group1-shard54of77.bin", "group1-shard55of77.bin", "group1-shard56of77.bin", "group1-shard57of77.bin", "group1-shard58of77.bin", "group1-shard59of77.bin", "group1-shard60of77.bin", "group1-shard61of77.bin", "group1-shard62of77.bin", "group1-shard63of77.bin", "group1-shard64of77.bin", "group1-shard65of77.bin", "group1-shard66of77.bin", "group1-shard67of77.bin", "group1-shard68of77.bin", "group1-shard69of77.bin", "group1-shard70of77.bin", "group1-shard71of77.bin", "group1-shard72of77.bin", "group1-shard73of77.bin", "group1-shard74of77.bin", "group1-shard75of77.bin", "group1-shard76of77.bin", "group1-shard77of77.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d_219/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_219/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_220/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_220/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2d_221/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_221/bias"}, {"dtype": "float32", "shape": [156800, 512], "name": "dense_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_11/bias"}, {"dtype": "float32", "shape": [512, 3], "name": "dense_12/kernel"}, {"dtype": "float32", "shape": [3], "name": "dense_12/bias"}]}], "modelTopology": {"training_config": {"metrics": [[{"class_name": "MeanMetricWrapper", "config": {"dtype": "float32", "name": "accuracy", "fn": "categorical_accuracy"}}]], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "loss_weights": null}, "keras_version": "2.4.0", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 150, 150, 3], "name": "conv2d_219_input", "sparse": false}}, {"class_name": "Conv2D", "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_219", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 150, 150, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_220", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_16", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_221", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_6", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_7"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.2.0", "format": "layers-model"}